Revit 2027 API
PrimaryDesignOptionMemberFilter Constructor
 Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PrimaryDesignOptionMemberFilter()
Public Sub New
public:
PrimaryDesignOptionMemberFilter()
new : unit -> PrimaryDesignOptionMemberFilter
See Also
Reference
PrimaryDesignOptionMemberFilter Class
PrimaryDesignOptionMemberFilter Overload
Autodesk.Revit.DB Namespace